-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Εξυπηρετητής: 127.0.0.1
-- Χρόνος δημιουργίας: 12 Ιαν 2022 στις 01:00:13
-- Έκδοση διακομιστή: 10.4.21-MariaDB
-- Έκδοση PHP: 8.0.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Βάση δεδομένων: `online_notice`
--

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `admin`
--

CREATE TABLE `admin` (
  `admin_id` int(11) NOT NULL,
  `user` varchar(50) CHARACTER SET latin1 NOT NULL,
  `pass` varchar(50) CHARACTER SET latin1 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Άδειασμα δεδομένων του πίνακα `admin`
--

INSERT INTO `admin` (`admin_id`, `user`, `pass`) VALUES
(1, 'admin@gmail.com', 'admin'),
(2, 'admin1@gmail.com', 'mario');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `notice`
--

CREATE TABLE `notice` (
  `notice_id` int(11) NOT NULL,
  `user` varchar(50) NOT NULL,
  `subject` varchar(100) NOT NULL,
  `Description` text NOT NULL,
  `Date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Άδειασμα δεδομένων του πίνακα `notice`
--

INSERT INTO `notice` (`notice_id`, `user`, `subject`, `Description`, `Date`) VALUES
(4, 'Θάνος Παπαδημητρίου', 'Παράταση προθεσμίας κατάθεσης της εργασίας', 'Η προθεσμία για την κατάθεση της εργασίας παρατάθηκε μέχρι τις 11/1/2022 - 06:00 (πρωί).', '2016-06-29 12:07:19'),
(6, 'Θάνος Παπαδημητρίου', 'Ανακοίνωση για ακύρωση του μαθήματος \"Επαναδιαμορφώσιμα Συστήματα Υλικού\" για Δευτέρα 8/11/2021 και ', 'Ανακοινώνεται ότι το μάθημα \"Επαναδιαμορφώσιμα Συστήματα Υλικού\" δεν θα πραγματοποιηθεί την\r\nΔευτέρα 8/11/2021 και την Τρίτη 9/11/2021 λόγω κωλύματος του διδάσκοντα.\r\n\r\n', '2016-07-31 15:38:35'),
(7, 'r', 'Προαιρετική απαλλακτική εργασία - 2021', 'Έχει αναρτηθεί στο eclass η εργασία του μαθήματος.', '2016-07-31 15:38:35'),
(8, 'Στέφανος Ουγιάρογλου', 'Εξέταση εργασιών', 'Η εξέταση των εργασιών στο μάθημα \"Ανάπτυξη Διαδικτυακών Εφαρμογών\" θα πραγματοποιηθεί την Τρίτη 18 Ιανουαρίου και την Τετάρτη 19 Ιανουαρίου σύμφωνα με το πρόγραμμα που θα ανακοινωθεί στο eclass.\r\n\r\nΓια να συμπεριληφθεί κάποια ομάδα στο πρόγραμμα εξέτασης και να εξεταστεί, θα πρέπει να έχει ανεβάσει έως την Παρασκευή 14 Ιανουαρίου έστω ένα μικρό μέρος της εργασίας στο github repository που δήλωσε στη φόρμα δήλωσης της εργασίας. Οι ομάδες με κένα repositories δεν θα συμπεριληφθούν στο πρόγραμμα εξέτασης των εργασιών. \r\n\r\nΥπενθυμίζεται ότι η προθεσμία ολοκλήρωσης της εργασίας είναι η Κυριακή 16 Ιανουαρίου 2022. \r\n\r\nΥπενθυμίζεται ότι η εκπόνηση της εργασίας αφορά το 35% της συνολικής βαθμολογίας του μαθήματος. Συνεπώς, αν κάποιος ή κάποια δεν εκπονήσει εργασία, θα πρέπει να γράψει άριστα στην τελική εξέταση και τελικά να βαθμολογηθεί με 6.5 ή θα πρέπει να γράψει πάνω από 7.5 για να πάρει τελικά 5 και να περάσει το μάθημα.  \r\n\r\nΚάποιες ομάδες ένω με έκαναν invite ως collaborator στο github repository που έφτιαξαν, το invitation έγινε expire. Παρακαλώ πολύ να με προσκαλέσουν εκ νέου. Οι φοιτητές που πρέπει να με προσκαλέσουν εκ νέου στο github είναι:', '2021-10-22 02:59:38'),
(9, 'Στέφανος Ουγιάρογλου', 'Παρουσίαση τεχνολογιών', 'Καλή χρόνιά με Υγεία, ευτυχία και πρόοδο.\r\n\r\nΥπενθυμίζεται ότι οι φοιτητές που εκπονούν την εργασία χρησιμοποιώντας τεχνολογίες που είναι διαφορετικές από αυτές που διδάσκονται στο μάθημα, θα πρέπει να παρουσιάσουν τις τεχνολογίες που χρησιμοποιούν (τις τεχνολογίες, όχι την εργασία) στο μάθημα που θα πραγματοποιηθεί την Τρίτη 11 Ιανουαρίου 2022. Για τον λόγο αυτό, θα πρέπει να ετοιμάσουν μια παρουσίαση που δεν θα ξεπερνά τα 30 λεπτά. \r\n\r\nΑν κάποιος φοιτητής / φοιτήτρια που εκπονεί την εργασία με διαφορετικές τεχνολογίες από αυτές που διδάσκονται στο μάθημα δεν μπορεί να βρίσκεται στο τμήμα την Τρίτη 11 Ιανουαρίου 2022, θα πρέπει να στείλει email στο stoug@uop.gr έως την Κυριακή 9 Ιανουαρίου 2022 ώστε κανονιστεί η ημέρα και η ώρα της παρουσίασης.', '2021-11-04 02:10:43'),
(10, 'Στέφανος Ουγιάρογλου', 'Αναβολή μαθήματος στις 16/11/2021', 'Η διάλεξη του μαθήματος \"Ανάπτυξη Διαδικτυακών Εφαρμογών\" δεν θα πραγμαοποιηθεί την Τρίτη 16/11/2021 λόγω κωλύματος του διδάσκοντα.', '2021-11-04 02:11:14'),
(11, 'ΠΑΝΑΓΙΩΤΗΣ ΚΟΚΚΙΝΟΣ', 'Εξέταση Σεπτεμβρίου 2020-2021', 'Η εξέταση του μαθήματος (31/8 9:00), θα πραγματοποιηθεί μέσω των Ασκήσεων του e-class και θα περιλαμβάνει ερωτήματα πολλαπλής επιλογής και ερωτήματα ανάπτυξης.\r\n\r\nΑρχικά θα γίνει η \"ταυτοποίηση\" των φοιητών μέσω τεαμσ:\r\n\r\nhttps://teams.microsoft.com/l/meetup-join/19%3a1a7547195b4b48159bc5e6447c82df6e%40thread.tacv2/1614264772770?context=%7b%22Tid%22%3a%22cb62fe3a-db7b-42ce-8c4e-d2a2af74d141%22%2c%22Oid%22%3a%22c9b0107e-b6a5-43ea-ac67-1c90e83a493a%22%7d', '2021-11-04 02:27:24'),
(12, 'ΠΑΝΑΓΙΩΤΗΣ ΚΟΚΚΙΝΟΣ', 'Ερωτήσεις', 'Αγαπητοί φοιτητές,\r\n\r\nΈχω λάβει κάποια εμαιλ σχετικά με την εξέταση που δεν έχω προλάβει να απαντήσω. \r\n\r\nΘα απαντήσω τις επόμενες ημέρες. ', '0000-00-00 00:00:00'),
(13, 'ΙΩΑΝΝΗΣ ΛΙΑΠΕΡΔΟΣ', 'Αλλαγή ημερομηνίας/ώρας μαθήματος', 'Το μάθημα της Τετάρτης 22 Δεκεμβρίου θα πραγματοποιηθεί την Τρίτη 21 Δεκεμβρίου και ώρα 12:00.	', '0000-00-00 00:00:00'),
(14, 'ΙΩΑΝΝΗΣ ΛΙΑΠΕΡΔΟΣ', 'Αναβολή μαθήματος', 'Το μάθημα της Τετάρτης 24/11/2021 δεν θα πραγματοποιηθεί.\r\n\r\nΗ ημέρα/ώρα αναπλήρωσής του θα γίνει γνωστή με νεότερη ανακοίνωση.', '0000-00-00 00:00:00'),
(15, 'ΝΕΚΤΑΡΙΟΣ ΚΡΑΝΙΤΗΣ', 'ΥΠΕΝΘΥΜΙΣΗ Γραπτή εξ\' αποστάσεως εξέταση μαθήματος', 'Καλησπέρα σας,\r\nΣας υπενθυμίζω ότι μεθαύριο Τετάρτη 8/9 στις 12:00 θα ξεκινήσει η εξέταση του μαθήματος.\r\n\r\nΗ επιτήρηση θα γίνει μέσω MS Teams και θα εξεταστείτε μέσω δοκιμασίας πολλαπλών απαντήσεων μέσω e-classs.\r\n\r\nΓια όσους αμέλησαν να εγγραφούν εγκαίρως στο teams, φροντίστε να εγγραφείτε εγκαίρως και σε κάθε περίπτωση ΠΡΙΝ την ώρα της εξέτασης.\r\n\r\nΚαλή επιτυχία σε όλες/όλους	', '0000-00-00 00:00:00'),
(16, 'ΝΕΚΤΑΡΙΟΣ ΚΡΑΝΙΤΗΣ', 'Διαδικασία εξ αποστάσεως εξέτασης μαθήματος Ιουνίου 2021', 'Χρήσιμες οδηγίες θα βρείτε στον παρακάτω σύνδεσμο\r\n\r\nhttps://ds.uop.gr/news/20210604-dilosi-simmetoxis-eks-e-2020-2021/\r\n\r\nΗ εξέταση του μαθήματος θα γίνει σύμφωνα με το σενάριο 3 που περιγράφεται στην απόφαση της συγκλήτου (εργαλείο ασκήσεις teams, επιτήρηση μέσω teams)\r\nhttps://di.uop.gr/images/010620-apofasi-29-5-2020.pdf\r\n\r\nΠαρακαλώ να έχετε γραφτεί στο teams του μαθήματος και το eclass με τον ΙΔΡΥΜΑΤΙΚΟ ΣΑΣ ΛΟΓΑΡΙΑΣΜΟ.	', '2022-01-12 00:57:07'),
(17, 'ΝΕΚΤΑΡΙΟΣ ΚΡΑΝΙΤΗΣ', 'ΥΠΕΝΘΥΜΙΣΗ Γραπτή εξ\' αποστάσεως εξέταση μαθήματος', 'Καλησπέρα σας,\r\n\r\nΣας υπενθυμίζω ότι σήμερα Τετάρτη 17/2 στις 15:00 θα ξεκινήσει η εξέταση του μαθήματος.\r\n\r\nΗ ΕΞΕΤΑΣΗ ΔΕΝ ΑΦΟΡΑ ΤΟΥ ΦΟΙΤΗΤΕΣ ΠΟΥ ΕΧΟΥΝ ΓΡΑΦΤΕΙ ΣΤΟ ΜΑΘΗΜΑ ΕΞΟΜΟΙΩΣΗΣ ΟΙ ΟΠΟΙΟΙ ΘΑ ΑΞΙΟΛΟΓΗΘΟΥΝ ΜΕ ΑΠΑΛΛΑΚΤΙΚΗ ΕΡΓΑΣΙΑ.\r\n\r\nΗ επιτήρηση για γίνει μέσω MS Teams και θα εξεταστείτε μέσω δοκιμασίας πολλαπλών απαντήσεων μέσω e-classs.\r\n\r\nΓια όσους αμέλησαν (!!!) να εγγραφούν εγκαίρως στο teams, φροντίστε να εγγραφείτε εγκαίρως και σε κάθε περίπτωση ΠΡΙΝ την  ώρα της εξέτασης.\r\n\r\nΚαλή επιτυχία σε όλες/όλους', '2022-01-12 01:00:05'),
(18, 'πυρίδων Χρονόπουλος', 'ΑΠΟΤΕΛΕΣΜΑΤΑ 1ης ΠΡΟΟΔΟΥ ΚΑΙ 2η ΠΡΟΟΔΟΣ', 'Ενημερώνονται οι φοιτητές ότι τα αποτελέσματα της 1ης προόδου έχουν αναρτηθεί στο e-class στον φάκελο Έγγραφα.\r\n\r\nΣε ό,τι αφορά την 2η πρόοδο, θα πραγματοποιηθεί κανονικά στις 21-01-2022 και ώρα 12:00-13:00. Θα προηγηθεί μάθημα (11:00-12:00) στην αίθουσα που αναγράφεται στο πρόγραμμα σπουδών.\r\n\r\nΌσοι φοιτητές δεν προσήλθαν στην 1η πρόοδο μπορούν να προσέλθουν στην 2η πρόοδο αλλά θα εξεταστούν εφ\' όλης της ύλης. Η εξέτασή τους θα διαρκέσει περίπου διπλάσιο χρόνο και τα θέματά τους θα είναι προσαυξημένα σε σύγκριση με τους φοιτητές που έχουν ήδη εξεταστεί στην 1η πρόοδο.\r\n\r\n \r\n\r\nΗ ύλη της δεύτερης προόδου για τους φοιτητές που έχουν ήδη εξεταστεί στην 1η πρόοδο είναι: 5ο έως και 12ο μάθημα (που θα διεξαχθεί την ερχόμενη εβδομάδα).\r\n\r\nΗ ύλη της δεύτερης προόδου για τους φοιτητές που δεν έχουν εξεταστεί στην 1η πρόοδο είναι: 1ο έως και 12ο μάθημα (που θα διεξαχθεί την ερχόμενη εβδομάδα).\r\n\r\nΤο 13ο μάθημα που θα διεξαχθεί στις 21-01-2022 δεν θα εξεταστεί σε καμμία πρόοδο.\r\n\r\nΗ ύλη των τελικών εξετάσεων περιέχει και τα 13 μαθήματα.', '2022-01-12 01:02:18'),
(19, 'πυρίδων Χρονόπουλος', 'ΔΙΕΞΑΓΩΓΗ ΜΑΘΗΜΑΤΟΣ ΚΑΙ ΠΡΟΟΔΟΥ ΣΤΙΣ 7/1/2022', 'Ενημερώνονται οι φοιτητές ότι το μάθημα στις 7/1/2022 θα διεξαχθεί στην αίθουσα (11:00-12:00) που προβλέπεται από το πρόγραμμα σπουδών. Εν συνεχεία θα διεξαχθεί πρόοδος με ώρα έναρξης 12:00. Η αίθουσα διεξαγωγής προόδου θα είναι η ίδια με εκείνη του μαθήματος (όπως ορίζεται στο πρόγραμμα σπουδών).\r\n\r\nΗ ύλη της 1ης προόδου αφορά τα 3 πρώτα πακέτα διαλέξεων (4 μαθήματα) μαζί με τις ερωτήσεις αυτοαξιολόγησής τους.\r\nΠροτείνεται να συμμετάσχουν όλοι οι φοιτητές.', '2022-01-12 01:03:56'),
(20, 'κουτρακις', 'θεμα', 'ελα και τη κανουμε', '2022-01-12 01:05:49'),
(21, 'Σπυρίδων Χρονόπουλος', 'ΔΙΕΞΑΓΩΓΗ ΜΑΘΗΜΑΤΩΝ 16/12/2021, 17/12/2021 ΚΑΙ ΠΡΟΟΔΟΥ ΣΤΙΣ 7/1/2022', 'Σε συνέχεια προηγούμενης ανακοίνωσης σχετικά με τα μαθήματα που πραγματοποιήθηκαν στις 16/12/2021 και 17/12/2021 επισημαίνεται ότι η διδακτέα ύλη έχει αναρτηθεί στο e-class και ακολούθως τα τέσσερα πρώτα πακέτα ερωτήσεων αυτοαξιολόγησης (Π1, Π2, Π2b, Π3) οι οποίες μελετήθηκαν και απαντήθηκαν στις ώρες του μαθήματος, αναφέρονται παρακάτω. Το υλικό πέρα από την κεντρική σελίδα του μαθήματος, είναι διαθέσιμο στο link του e-class με ονομασία		', '2022-01-12 01:33:55'),
(22, 'Σπυρίδων Χρονόπουλος', 'Πέμπτη 16/12/2021 και ώρα έναρξης 09.00 (Αναπλήρωση) Πέμπτη 16/12/2021 και ώρα έναρξης 16:00 (Τελευτ', 'ΔΙΕΞΑΓΩΓΗ ΜΑΘΗΜΑΤΩΝ 16/12/2021, 17/12/2021 ΚΑΙ ΠΡΟΟΔΟΥ ΣΤΙΣ 7/1/2022', '2022-01-12 01:43:37'),
(23, 'Σπυρίδων Χρονόπουλος', 'Σπυρίδω', 'Σε συνέχεια προηγούμενης ανακοίνωσης σχετικά με τα μαθήματα που πραγματοποιήθηκαν στις 16/12/2021 και 17/12/2021 επισημαίνετα', '2022-01-12 01:45:04'),
(24, 'γιορ', 'θεμα', 'ελα μου', '2022-01-12 01:59:06');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `name` char(40) CHARACTER SET latin1 NOT NULL,
  `email` varchar(40) CHARACTER SET latin1 NOT NULL,
  `pass` varchar(40) CHARACTER SET latin1 NOT NULL,
  `mobile` bigint(11) NOT NULL,
  `gender` varchar(40) CHARACTER SET latin1 NOT NULL,
  `hobbies` varchar(40) CHARACTER SET latin1 NOT NULL,
  `image` varchar(50) CHARACTER SET latin1 NOT NULL,
  `dob` datetime NOT NULL,
  `regid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Άδειασμα δεδομένων του πίνακα `user`
--

INSERT INTO `user` (`id`, `name`, `email`, `pass`, `mobile`, `gender`, `hobbies`, `image`, `dob`, `regid`) VALUES
(7, 'niki', 'niki@gmail.com', 'mario', 8787878, 'f', 'reading', '', '1965-09-15 00:00:00', 2147483647),
(8, 'ravivvvv', 'ravi@gmail.com', '63dd3e154ca6d948fc380fa576343ba6', 878787, 'm', 'reading,singin', 'Lighthouse.jpg', '1966-09-15 00:00:00', 2147483647),
(11, 'abhibbb', 'abhi@gmail.com', 'd76f3d05cc9ac98f1f9160274a39fe33', 9015501897, 'm', 'reading,singin,playing', 'Lighthouse.jpg', '1965-10-17 00:00:00', 2147483647),
(12, 'amarildo', 'amarildo@gmail.com', 'de2f15d014d40b93578d255e6221fd60', 654, 'm', 'reading', 'uoplogo.png', '1983-10-17 00:00:00', 2147483647),
(13, 'Amarildo hoxha', 'ds18137@go.uop.gr', 'de2f15d014d40b93578d255e6221fd60', 6976285492, 'm', 'reading', 'uoplogo.png', '1967-11-18 00:00:00', 2147483647);

--
-- Ευρετήρια για άχρηστους πίνακες
--

--
-- Ευρετήρια για πίνακα `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`admin_id`);

--
-- Ευρετήρια για πίνακα `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`notice_id`);

--
-- Ευρετήρια για πίνακα `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);
ALTER TABLE `user` ADD FULLTEXT KEY `name` (`name`);

--
-- AUTO_INCREMENT για άχρηστους πίνακες
--

--
-- AUTO_INCREMENT για πίνακα `admin`
--
ALTER TABLE `admin`
  MODIFY `admin_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT για πίνακα `notice`
--
ALTER TABLE `notice`
  MODIFY `notice_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT για πίνακα `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
